jonahn/EE478/Lab2/h/p18f65j94.h
extern volatile far  unsigned char       MDSRC;
extern volatile far  union {
  struct {
    unsigned MDSRC:4;
    unsigned :3;
    unsigned MDSODIS:1;
  };
  struct {
    unsigned MDSRC0:1;
    unsigned MDSRC1:1;
    unsigned MDSRC2:1;
    unsigned MDSRC3:1;
  };
} MDSRCbits;
extern volatile far  unsigned char       MDCON;
extern volatile far  struct {
  unsigned MDBIT:1;
  unsigned :2;
  unsigned MDO:1;
  unsigned MDOPOL:1;
  unsigned MDSLR:1;
  unsigned MDOE:1;
  unsigned MDEN:1;
} MDCONbits;
extern volatile far  unsigned char       PMD4;
extern volatile far  struct {
  unsigned EMBMD:1;
  unsigned :1;
  unsigned LVDMD:1;
  unsigned IOCMD:1;
  unsigned USBMD:1;
  unsigned CMP3MD:1;
  unsigned CMP2MD:1;
  unsigned CMP1MD:1;
} PMD4bits;
extern volatile far  unsigned char       PMD3;
extern volatile far  union {
  struct {
    unsigned REFO2MD:1;
    unsigned REFO1MD:1;
    unsigned PSPMD:1;
    unsigned LCDMD:1;
    unsigned RTCCMD:1;
    unsigned ADCMD:1;
    unsigned CTMUMD:1;
    unsigned MODMD:1;
  };
  struct {
    unsigned :7;
    unsigned TXMMD:1;
  };
} PMD3bits;
extern volatile far  unsigned char       PMD2;
extern volatile far  struct {
  unsigned TMR0MD:1;
  unsigned TMR1MD:1;
  unsigned TMR2MD:1;
  unsigned TMR3MD:1;
  unsigned TMR4MD:1;
  unsigned TMR5MD:1;
  unsigned TMR6MD:1;
  unsigned TMR8MD:1;
} PMD2bits;
extern volatile far  unsigned char       PMD1;
extern volatile far  struct {
  unsigned SSP1MD:1;
  unsigned SSP2MD:1;
  unsigned UART1MD:1;
  unsigned UART2MD:1;
  unsigned UART3MD:1;
  unsigned UART4MD:1;
  unsigned ECCP1MD:1;
  unsigned ECCP2MD:1;
} PMD1bits;
extern volatile far  unsigned char       PMD0;
extern volatile far  struct {
  unsigned ECCP3MD:1;
  unsigned CCP4MD:1;
  unsigned CCP5MD:1;
  unsigned CCP6MD:1;
  unsigned CCP7MD:1;
  unsigned CCP8MD:1;
  unsigned CCP9MD:1;
  unsigned CCP10MD:1;
} PMD0bits;
extern volatile far  unsigned char       CTMUCON4;
extern volatile far  union {
  struct {
    unsigned EDG1STAT:1;
    unsigned EDG2STAT:1;
    unsigned EDG1SEL:4;
    unsigned EDG1POL:1;
    unsigned EDG1EN:1;
  };
  struct {
    unsigned :2;
    unsigned EDG1SEL0:1;
    unsigned EDG1SEL1:1;
    unsigned EDG1SEL2:1;
    unsigned EDG1SEL3:1;
  };
} CTMUCON4bits;
extern volatile far  unsigned char       CTMUCON3;
extern volatile far  union {
  struct {
    unsigned :2;
    unsigned EDG2SEL:4;
    unsigned EDG2POL:1;
    unsigned EDG2EN:1;
  };
  struct {
    unsigned :2;
    unsigned EDG2SEL0:1;
    unsigned EDG2SEL1:1;
    unsigned EDG2SEL2:1;
    unsigned EDG2SEL3:1;
  };
} CTMUCON3bits;
extern volatile far  unsigned char       CTMUCON2;
extern volatile far  union {
  struct {
    unsigned IRNG:2;
    unsigned ITRIM:6;
  };
  struct {
    unsigned IRNG0:1;
    unsigned IRNG1:1;
    unsigned ITRIM0:1;
    unsigned ITRIM1:1;
    unsigned ITRIM2:1;
    unsigned ITRIM3:1;
    unsigned ITRIM4:1;
    unsigned ITRIM5:1;
  };
} CTMUCON2bits;
extern volatile far  unsigned char       CTMUCON1;
extern volatile far  struct {
  unsigned CTTRIG:1;
  unsigned IDISSEN:1;
  unsigned EDGSEQEN:1;
  unsigned EDGEN:1;
  unsigned TGEN:1;
  unsigned CTMUSIDL:1;
  unsigned :1;
  unsigned CTMUEN:1;
} CTMUCON1bits;
extern volatile far  unsigned char       TXREG4;
extern volatile far  unsigned char       RCREG4;
extern volatile far  unsigned char       SPBRG4;
extern volatile far  union {
  struct {
    unsigned SPBRG4:8;
  };
  struct {
    unsigned BRG0:1;
    unsigned BRG1:1;
    unsigned BRG2:1;
    unsigned BRG3:1;
    unsigned BRG4:1;
    unsigned BRG5:1;
    unsigned BRG6:1;
    unsigned BRG7:1;
  };
} SPBRG4bits;
extern volatile far  unsigned char       SPBRGH4;
extern volatile far  union {
  struct {
    unsigned SPBRGH4:8;
  };
  struct {
    unsigned BRG8:1;
    unsigned BRG9:1;
    unsigned BRG10:1;
    unsigned BRG11:1;
    unsigned BRG12:1;
    unsigned BRG13:1;
    unsigned BRG14:1;
    unsigned BRG15:1;
  };
} SPBRGH4bits;
extern volatile far  unsigned char       BAUDCON4;
extern volatile far  struct {
  unsigned ABDEN:1;
  unsigned WUE:1;
  unsigned IREN:1;
  unsigned BRG16:1;
  unsigned TXCKP:1;
  unsigned RXDTP:1;
  unsigned RCIDL:1;
  unsigned ABDOVF:1;
} BAUDCON4bits;
extern volatile far  unsigned char       TXSTA4;
extern volatile far  struct {
  unsigned TX9D:1;
  unsigned TRMT:1;
  unsigned BRGH:1;
  unsigned SENDB:1;
  unsigned SYNC:1;
  unsigned TXEN:1;
  unsigned TX9:1;
  unsigned CSRC:1;
} TXSTA4bits;
extern volatile far  unsigned char       RCSTA4;
extern volatile far  struct {
  unsigned RX9D:1;
  unsigned OERR:1;
  unsigned FERR:1;
  unsigned ADDEN:1;
  unsigned CREN:1;
  unsigned SREN:1;
  unsigned RX9:1;
  unsigned SPEN:1;
} RCSTA4bits;
extern volatile far  unsigned char       DMACON2;
extern volatile far  union {
  struct {
    unsigned INTLVL:4;
    unsigned DLYCYC:4;
  };
  struct {
    unsigned INTLVL0:1;
    unsigned INTLVL1:1;
    unsigned INTLVL2:1;
    unsigned INTLVL3:1;
    unsigned DLYCYC0:1;
    unsigned DLYCYC1:1;
    unsigned DLYCYC2:1;
    unsigned DLYCYC3:1;
  };
} DMACON2bits;
extern volatile far  unsigned char       ANCFG;
extern volatile far  struct {
  unsigned VBGEN:1;
  unsigned VBG2EN:1;
  unsigned VBG6EN:1;
} ANCFGbits;
extern volatile far  unsigned char       SSP2ADD;
extern volatile far  unsigned char       SSP2BUF;
extern volatile far  unsigned char       T4CON;
extern volatile far  union {
  struct {
    unsigned T4CKPS:2;
    unsigned TMR4ON:1;
    unsigned T4OUTPS:4;
  };
  struct {
    unsigned T4CKPS0:1;
    unsigned T4CKPS1:1;
    unsigned :1;
    unsigned T4OUTPS0:1;
    unsigned T4OUTPS1:1;
    unsigned T4OUTPS2:1;
    unsigned T4OUTPS3:1;
  };
} T4CONbits;
extern volatile far  unsigned char       PR4;
extern volatile far  unsigned char       TMR4;
extern volatile far  unsigned char       CCP7CON;
extern volatile far  union {
  struct {
    unsigned CCP7M:4;
    unsigned DC7B:2;
  };
  struct {
    unsigned CCP7M0:1;
    unsigned CCP7M1:1;
    unsigned CCP7M2:1;
    unsigned CCP7M3:1;
    unsigned DC7B0:1;
    unsigned DC7B1:1;
  };
  struct {
    unsigned :4;
    unsigned CCP7Y:1;
    unsigned CCP7X:1;
  };
} CCP7CONbits;
